export const questions = [
  {
    question: "Что такое Virtual DOM в React?",
    answers: [
      "Копия реального DOM, хранящаяся в памяти и используемая для оптимизации обновлений",
      "DOM, который существует только на сервере",
      "HTML-шаблон, который компилируется браузером",
    ],
    rightAnswer: 1,
  },
  {
    question: "Для чего используется хук useState в React?",
    answers: [
      "Для выполнения побочных эффектов",
      "Для хранения и обновления состояния компонента",
      "Для передачи данных между компонентами",
    ],
    rightAnswer: 2,
  },
  {
    question: "Какое значение вернёт выражение typeof null в JavaScript?",
    answers: ['"null"', '"object"', '"undefined"'],
    rightAnswer: 2,
  },
  {
    question: "Какой метод массива НЕ изменяет исходный массив?",
    answers: ["push()", "splice()", "map()"],
    rightAnswer: 3,
  },
  {
    question: "Зачем в React используются key при рендеринге списков?",
    answers: [
      "Для передачи данных в дочерний компонент",

      "Для уникальной идентификации элементов списка и оптимизации рендера",
      "Для задания стилей элементам списка",
    ],
    rightAnswer: 2,
  },
]
